ERP.belugaerp/src/InformationRegisters/бг_ОбъектыДляОтложеннойОбработки/бг_ОбъектыДляОтложеннойОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ОбъектыДляОтложеннойОбработки</name>
  <resources>
    <name>ДополнительныеСведения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.битОтражениеФактаПоПриходномуОрдеру</types>
      <types>DocumentRef.АктПостановкиНаБалансЕГАИС</types>
      <types>DocumentRef.ТТНВходящаяЕГАИС</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.битПереупаковка</types>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
      <types>DocumentRef.битЗаявкаКлиента</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.битОтчетОбИмпортеПродукцииЕГАИС</types>
      <types>DocumentRef.битОтражениеФактаПоРасходномуОрдеру</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.битОтчетОПроизводствеЕГАИС</types>
      <types>DocumentRef.битМаршрутныйЛист</types>
      <types>CatalogRef.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантОбработки</name>
    <type>
      <types>EnumRef.бг_ВариантыОтложеннойОбработкиОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяРегистрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ДокументыИнтеграцииСоСкладскимиСистемами/бг_ДокументыИнтеграцииСоСкладскимиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ДокументыИнтеграцииСоСкладскимиСистемами</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.битОтражениеФактаПоПриходномуОрдеру</types>
      <types>DocumentRef.битПереупаковка</types>
      <types>DocumentRef.битИнвентаризацияПродукцииЕГАИС</types>
      <types>DocumentRef.битОтражениеФактаПоРасходномуОрдеру</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_ВариантыВыгрузкиАкцизныхМарок/бг_ВариантыВыгрузкиАкцизныхМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВариантыВыгрузкиАкцизныхМарок</name>
  <enumValues>
    <name>НеВыгружать</name>
  </enumValues>
  <enumValues>
    <name>ВСообщении</name>
  </enumValues>
  <enumValues>
    <name>ЧерезФайл</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ВариантыОтложеннойОбработкиОбъектов/бг_ВариантыОтложеннойОбработкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВариантыОтложеннойОбработкиОбъектов</name>
  <enumValues>
    <name>АвтоСогласованиеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьОбеспечениеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ИзменитьДатуСвязанныхУчетныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьАкцизныеМарки</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьДокументыWMS</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьНовуюОрганизациюЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьПрисоединенныйФайлПисьма</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьЗапросыСправки1ЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОтразитьДополнительныеСведенияЗаказаКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПередатьЗаказыКлиентовНаСборку</name>
  </enumValues>
  <enumValues>
    <name>ПерезаполнитьЗаявкиНаРасходованиеДС</name>
    <comment>Проект &quot;Магистраль&quot;</comment>
  </enumValues>
  <enumValues>
    <name>РассчитатьПоказателиРаботыОператоровWMS</name>
  </enumValues>
  <enumValues>
    <name>СоздатьИзменитьПодчиненнуюРеализацию</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЗаказМагазина</name>
  </enumValues>
  <enumValues>
    <name>СоздатьНоменклатуруПартнера</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДокументы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьИнтернетЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРейсы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДвиженияМарок</name>
  </enumValues>
  <enumValues>
    <name>СформироватьОрдераНаОтражениеПересортицы</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьРезервыПриПоступленииТовара</name>
  </enumValues>
  <enumValues>
    <name>СформироватьПриходныйОрдерНаТовары</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРасходныйОрдерНаТовары</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами/бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами</name>
  <enumValues>
    <name>ЗагруженБезОбработки</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженИОбработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/битОтражениеФактаПоПриходномуОрдеру/битОтражениеФактаПоПриходномуОрдеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битОтражениеФактаПоПриходномуОрдеру</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_СоставУпаковок</registerRecords>
  <registerRecords>AccumulationRegister.бг_ПоказателиРаботыОператоровWMS</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>ПриходныйОрдерНаТовары</name>
    <type>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнешнейСкладскойСистемы</name>
    <type>
      <types>EnumRef.бг_ТипыВнешнихСкладскихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАлкогольнаяПродукция</name>
    <comment>// Признак что требуется ТТН</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьМаркируемаяАлкогольнаяПродукция</name>
    <comment>// Признак что требуются марки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПриемки</name>
    <type>
      <types>EnumRef.бг_РезультатыПриемкиWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ОператорТСД</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусSolvo</name>
    <type>
      <types>EnumRef.бг_СтатусыПриемкиSolvo</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Упаковки</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>26</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/CommonModules/бг_битОтражениеФактаПоПриходномуОрдеруИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства);	
	
КонецПроцедуры

Процедура ЗаполнитьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтруктураОбъекта, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено, СтандартнаяОбработка) Экспорт

	Перем адаптер_ОбработчикиСобытийСтандартный;
	адаптер_ОбработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_ОбработчикиСобытийСтандартный");
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ЗагружаемыйОбъект.Ссылка) Тогда
		
		ПриходныйОрдерНаТовары = Документы.ПриходныйОрдерНаТовары.ПолучитьСсылку(
			Новый УникальныйИдентификатор(
				СтруктураОбъекта.ПриходныйОрдерНаТовары.Идентификатор));
		
		Если ЗначениеЗаполнено(ПриходныйОрдерНаТовары) И ОбщегоНазначения.СсылкаСуществует(ПриходныйОрдерНаТовары) Тогда
			
			ДанныеОрдера = Документы.ПриходныйОрдерНаТовары.бг_ДанныеОрдераWMS(ПриходныйОрдерНаТовары);
			ЗаполнитьЗначенияСвойств(ЗагружаемыйОбъект, ДанныеОрдера);
			
		Иначе
			ВызватьИсключение НСтр("ru='Документ должен быть связан с приходным ордером.'");
		КонецЕсли;
	КонецЕсли;
		
	Если ЭтоSolvoПоСтруктуре(СтруктураОбъекта)
		И ЭтоИнформативныйСтатусSolvoПоСтруктуре(
			СтруктураОбъекта,
			ЗагружаемыйОбъект.ЕстьМаркируемаяАлкогольнаяПродукция) Тогда
		
		ЗагружаемыйОбъект.СтатусSolvo = Перечисления.бг_СтатусыПриемкиSolvo[СтруктураОбъекта.СтатусSolvo.ЗначениеПеречисления];
		
	Иначе
		
		адаптер_ОбработчикиСобытийСтандартный.ЗаполнитьЗагружаемыйОбъект(
			ЗагружаемыйОбъект,
			СтруктураОбъекта,,
			"Номер, Проведен");
		
		Если СтруктураОбъекта.ВариантЗагрузкиМарок = Перечисления.бг_ВариантыВыгрузкиАкцизныхМарок.ЧерезФайл Тогда
			ЗаполнитьМаркиУпаковкиИзФайла(ЗагружаемыйОбъект, СтруктураОбъекта);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ЗагружаемыйОбъект.Ссылка) Тогда
		
		ЗагружаемыйОбъект.ЗафиксироватьИзмененияПередЗаписью();
		
		Если Не ЗагружаемыйОбъект.ВДокументВнесеныВажныеИзменения() Тогда
			ЗагружаемыйОбъект.ДополнительныеСвойства.Вставить("СтандартнаяЗаписьНеТребуется", Истина);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗагружаемыйОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если бг_КонстантыПовтИсп.ЗначениеКонстанты("ПроводитьДокументыОтWMSОтложенно") Тогда
		
		Если Документы.битОтражениеФактаПоПриходномуОрдеру.НеобходимоПроводитьДокумент(ЗагружаемыйОбъект) Тогда
			
			ЗагружаемыйОбъект.ДополнительныеСвойства.Вставить(
				"бг_НеРегистрироватьПоказателиЗаказаКлиентаКОбновлению",
				Истина);
				
			РегистрыСведений.бг_ОбъектыДляОтложеннойОбработки.ДобавитьОбъект(
				ЗагружаемыйОбъект.Ссылка,
				Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов.ОбработатьДокументыWMS);
				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиДанныхОбъектаВИБ(ЗагружаемыйОбъект, РезультатОбработки) Экспорт
	
	Если Не РезультатОбработки.Успешно Тогда
		Возврат;
	КонецЕсли;
	
	Если бг_КонстантыПовтИсп.ЗначениеКонстанты("ПроводитьДокументыОтWMSОтложенно") Тогда
		Возврат;
	КонецЕсли;
	
	НеобходимоПроводитьДокумент = Документы.битОтражениеФактаПоПриходномуОрдеру.НеобходимоПроводитьДокумент(ЗагружаемыйОбъект);
	
	Если НеобходимоПроводитьДокумент Тогда
		
		Попытка
			
			ЗагружаемыйОбъект.Заблокировать();
			ЗагружаемыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
				
			ШапкаОшибки = ОписаниеОшибки();
			
			ТелоОшибки = "";
			Для каждого СообщениеПользователю Из ПолучитьСообщенияПользователю(Истина) Цикл
				ТелоОшибки = ТелоОшибки + ?(ПустаяСтрока(ТелоОшибки), "", Символы.ПС) + СообщениеПользователю.Текст;
			КонецЦикла;
			
			ТекстОшибки = ШапкаОшибки + Символы.ПС + ТелоОшибки;
			
			РегистрыСведений.бг_ДокументыИнтеграцииСоСкладскимиСистемами.ОбновитьСтатусДокумента(
				ЗагружаемыйОбъект.Ссылка,
				ТекущаяДатаСеанса(),
				Перечисления.бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами.ЗагруженБезОбработки,
				0,
				ТекстОшибки);
			
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // Конец ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства)

	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства, 
		Метаданные.Справочники.Номенклатура, 
		, 
		"КодЕК_Номенклатуры", 
		ОбщегоНазначения.ОписаниеТипаСтрока(8));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства, 
		Метаданные.Справочники.Номенклатура, 
		, 
		"КодЕК_ПОСМ", 
		ОбщегоНазначения.ОписаниеТипаСтрока(бг_НоменклатураИнтеграция.ДлинаКодаЕК_ПОСМ()));
	
КонецПроцедуры

Функция ЭтоSolvoПоСтруктуре(СтруктураОбъекта)
	
	Возврат СтруктураОбъекта.Свойство("СтатусSolvo")
		И СтруктураОбъекта.СтатусSolvo.Свойство("ЗначениеПеречисления")
		И ЗначениеЗаполнено(СтруктураОбъекта.СтатусSolvo.ЗначениеПеречисления)
		И Метаданные.Перечисления.бг_СтатусыПриемкиSolvo.ЗначенияПеречисления.Найти(
			СтруктураОбъекта.СтатусSolvo.ЗначениеПеречисления) <> Неопределено;

КонецФункции

Функция ЭтоИнформативныйСтатусSolvoПоСтруктуре(СтруктураОбъекта, ЕстьМаркируемаяАлкогольнаяПродукция)
	
	ИмяСтатуса = СтруктураОбъекта.СтатусSolvo.ЗначениеПеречисления;
	
	КонечныеИнформативныеСтатусы = Документы.битОтражениеФактаПоПриходномуОрдеру.КонечныеИнформативныеСтатусыSolvo(
		ЕстьМаркируемаяАлкогольнаяПродукция);
		
	СтатусSolvo = Перечисления.бг_СтатусыПриемкиSolvo[ИмяСтатуса];
	
	Возврат КонечныеИнформативныеСтатусы.Найти(СтатусSolvo) <> Неопределено;

КонецФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	// Реквизиты в шапку сообщения		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"ВариантЗагрузкиМарок",
		Новый ОписаниеТипов("ПеречислениеСсылка.бг_ВариантыВыгрузкиАкцизныхМарок"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"АдресФайлаМарок",
		ОбщегоНазначения.ОписаниеТипаСтрока(500));

КонецПроцедуры

Процедура ЗаполнитьМаркиУпаковкиИзФайла(ЗагружаемыйОбъект, СтруктураОбъекта)
	
	ДанныеМарокУпаковок = бг_МаркируемаяПродукция.ДанныеМарокУпаковокИзФайла(СтруктураОбъекта.АдресФайлаМарок);
	
	бг_МаркируемаяПродукция.ЗаполнитьТаблицуОбъектаПоДаннымМарокУпаковокИзФайла(
		ЗагружаемыйОбъект, "Марки", ДанныеМарокУпаковок);
	бг_МаркируемаяПродукция.ЗаполнитьТаблицуОбъектаПоДаннымМарокУпаковокИзФайла(
		ЗагружаемыйОбъект, "Упаковки", ДанныеМарокУпаковок);	
	
КонецПроцедуры

#КонецОбласти
